Revit 2024 API
FilteredWorksetIterator Class
 An iterator to a set of worksets filtered by the settings of a FilteredWorksetCollector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class FilteredWorksetIterator : IEnumerator<Workset>
Visual Basic
Public Class FilteredWorksetIterator _
	Implements IEnumerator(Of Workset)
Visual C++
public ref class FilteredWorksetIterator : IEnumerator<Workset^>
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilteredWorksetIterator
See Also
FilteredWorksetIterator Members
Autodesk.Revit.DB Namespace